Revit 2027 API
DimensionType.GetOrdinateDimensionSetting Method
 Gets the ordinate dimension settings for this DimensionType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OrdinateDimensionSetting GetOrdinateDimensionSetting()
Public Function GetOrdinateDimensionSetting As OrdinateDimensionSetting
public:
OrdinateDimensionSetting^ GetOrdinateDimensionSetting()
member GetOrdinateDimensionSetting : unit -> OrdinateDimensionSetting
Return Value
OrdinateDimensionSetting
 The ordinate dimension settings.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace